---
kind: type
id: T:Autodesk.Revit.DB.Analysis.HVACLoadConstructionClass
source: html/84d0820f-20d2-bda1-5859-f2033a72bb84.htm
---
# Autodesk.Revit.DB.Analysis.HVACLoadConstructionClass

Enumerated type listing options for construction class for HVAC analysis.

## Syntax (C#)
```csharp
public enum HVACLoadConstructionClass
```